function iranSolar() {
    this._init();
}

iranSolar.prototype = {
    name: 'مناسبت‌های رسمی ایران',
    type: 'persian',
    /* [month][day] = [title, isHoliday] */
    events: [[], [], [], [], [], [], [], [], [], [], [], [], []],

    _init: function () {/** Edit by: jdf.scr.ir */

        this.events[1][1] = [[
            ['آغاز نوروز', true]
        ], true];

        this.events[1][2] = [[
            ['عید نوروز', true],
            ['هجوم مأموران ستم‌شاهی پهلوی به مدرسه‌ی فیضیه‌ی قم'],
            ['آغاز عملیات فتح‌المبین']
        ], true];

        this.events[1][3] = [[
            ['عید نوروز', true]
        ], true];

        this.events[1][4] = [[
            ['عید نوروز', true]
        ], true];

        this.events[1][6] = [[
            ['ولادت زرتشت']
        ], false];

        this.events[1][7] = [[
            ['روز هنرهای نمایشی']
        ], false];

        this.events[1][12] = [[
            ['روز جمهوری اسلامی ایران', true]
        ], true];

        this.events[1][13] = [[
            ['روز طبیعت', true]
        ], true];

        this.events[1][15] = [[
            ['روز ذخایر ژنتیکی و زیستی']
        ], false];

        this.events[1][18] = [[
            ['روز سلامتی']
        ], false];

        this.events[1][19] = [[
            ['شهادت آیت‌اللّه سیدمحمدباقر صدر و خواهر ایشان بنت‌الهدی به دست حکومت بعث عراق']
        ], false];

        this.events[1][20] = [[
            ['روز ملّی فنّاوری هسته‌ای'],
            ['روز هنر انقلاب اسلامی (سالروز شهادت سیدمرتضی آوینی)']
        ], false];

        this.events[1][21] = [[
            ['شهادت امیر سپهبد علی صیاد شیرازی'],
            ['سالروز افتتاح حساب شماره‌ی 100 به فرمان امام خمینی (رحمة‌اللّه علیه) و تأسیس بنیاد مسکن انقلاب اسلامی']
        ], false];

        this.events[1][25] = [[
            ['روز بزرگداشت عطّار نیشابوری']
        ], false];

        this.events[1][29] = [[
            ['روز ارتش جمهوری اسلامی و نیروی زمینی']
        ], false];

        this.events[2][1] = [[
            ['روز بزرگداشت سعدی']
        ], false];

        this.events[2][2] = [[
            ['تأسیس سپاه پاسداران انقلاب اسلامی'],
            ['سالروز اعلام انقلاب فرهنگی'],
            ['روز زمین پاک']
        ], false];

        this.events[2][3] = [[
            ['روز بزرگداشت شیخ بهایی'],
            ['روز معماری'],
            ['سالروز شهادت امیر سپهبد قرنی']
        ], false];

        this.events[2][5] = [[
            ['شکست حمله نظامی آمریکا به ایران در طبس']
        ], false];

        this.events[2][7] = [[
            ['روز ایمنی حمل و نقل']
        ], false];

        this.events[2][9] = [[
            ['روز شوراها']
        ], false];

        this.events[2][10] = [[
            ['روز ملی خلیج فارس'],
            ['آغاز عملیات بیت المقدس']
        ], false];

        this.events[2][12] = [[
            ['شهادت استاد مرتضی مطهری و روز معلم']
        ], false];

        this.events[2][15] = [[
            ['روز بزرگداشت شیخ صدوق']
        ], false];

        this.events[2][18] = [[
            ['روز بیماری‌های خاص و صعب‌العلاج']
        ], false];

        this.events[2][19] = [[
            ['روز بزرگداشت شیخ کلینی'],
            ['روز اسناد ملی و میراث مکتوب']
        ], false];

        this.events[2][24] = [[
            ['لغو امتیاز تنباکو به فتوای آیت‌اللّه میرزا حسن شیرازی']
        ], false];

        this.events[2][25] = [[
            ['روز پاسداشت زبان فارسی و بزرگداشت حکیم ابوالقاسم فردوسی']
        ], false];

        this.events[2][27] = [[
            ['روز ارتباطات و روابط عمومی']
        ], false];

        this.events[2][28] = [[
            ['روز بزرگداشت حکیم عمر خیام']
        ], false];

        this.events[2][30] = [[
            ['روز ملی جمعیت']
        ], false];

        this.events[2][31] = [[
            ['روز اهدای عضو، اهدای زندگی']
        ], false];

        this.events[3][1] = [[
            ['روز بهره‌وری و بهینه‌سازی مصرف'],
            ['روز بزرگداشت ملّاصدرا (صدرالمتألهین)']
        ], false];

        this.events[3][3] = [[
            ['فتح خرمشهر در عملیات بیت‌المقدس و روز مقاومت، ایثار و پیروزی']
        ], false];

        this.events[3][4] = [[
            ['روز دزفول'],
            ['روز مقاومت و پایداری']
        ], false];

        this.events[3][5] = [[
            ['روز نسیم مهر (روز حمایت از خانواده زندانیان)']
        ], false];

        this.events[3][7] = [[
            ['افتتاح اولین دوره‌ی مجلس شورای اسلامی']
        ], false];

        this.events[3][14] = [[
            ['رحلت حضرت امام خمینی (رحمة‌اللّه علیه) رهبر کبیر انقلاب و بنیان‌گذار جمهوری اسلامی ایران', true],
            ['انتخاب حضرت آیت‌اللّه امام خامنه‌ای به رهبری']
        ], true];

        this.events[3][15] = [[
            ['قیام خونین 15 خرداد', true],
            ['زندانی شدن حضرت امام خمینی (رحمة‌اللّه علیه) به دست مأموران ستم‌شاهی پهلوی']
        ], true];

        this.events[3][20] = [[
            ['روز صنایع دستی'],
            ['شهادت آیت‌اللّه سعیدی به دست مأموران ستم‌شاهی پهلوی']
        ], false];

        this.events[3][26] = [[
            ['شهادت سربازان دلیر اسلام :بخارایی، امانی، صفار هرندی و نیک‌نژاد']
        ], false];

        this.events[3][27] = [[
            ['روز جهاد کشاورزی (تشکیل جهاد سازندگی به فرمان حضرت امام خمینی رحمة‌اللّه علیه)']
        ], false];

        this.events[3][29] = [[
            ['درگذشت دکتر علی شریعتی']
        ], false];

        this.events[3][30] = [[
            ['شهادت زائران حرم رضوی علیه‌السلام به دست ایادی آمریکا در روز عاشورا']
        ], false];

        this.events[3][31] = [[
            ['شهادت دکتر مصطفی چمران'],
            ['روز بسیج استادان']
        ], false];

        this.events[4][1] = [[
            ['روز تبلیغ و اطلاع‌رسانی دینی (سالروز صدور فرمان امام خمینی رحمة‌اللّه علیه مبنی بر تأسیس سازمان تبلیغات اسلامی)'],
            ['روز اصناف']
        ], false];

        this.events[4][7] = [[
            ['شهادت مظلومانه‌ی آیت‌اللّه دکتر بهشتی و 72 تن از یاران امام با انفجار بمب به دست منافقان در دفتر مرکزی حزب جمهوری اسلامی'],
            ['روز قوه‌ی قضائیه'],
            ['سالروز بمباران شیمیایی شهر سردشت']
        ], false];

        this.events[4][8] = [[
            ['روز مبارزه با سلاح‌های شیمیایی و میکروبی']
        ], false];

        this.events[4][10] = [[
            ['روز صنعت و معدن'],
            ['روز آزادسازی شهر مهران'],
            ['روز بزرگداشت صائب تبریزی']
        ], false];

        this.events[4][11] = [[
            ['شهادت آیت‌اللّه صدوقی چهارمین شهید محراب به دست منافقان']
        ], false];

        this.events[4][12] = [[
            ['حمله‌ی ددمنشانه‌ی ناوگان آمریکای جنایتکار به هواپیمای مسافربری جمهوری اسلامی ایران'],
            ['روز افشای حقوق بشر آمریکایی'],
            ['روز بزرگداشت علامه امینی']
        ], false];

        this.events[4][14] = [[
            ['روز قلم'],
            ['روز شهرداری و دهیاری']
        ], false];

        this.events[4][16] = [[
            ['روز مالیات']
        ], false];

        this.events[4][18] = [[
            ['روز ادبیات کودکان و نوجوانان'],
            ['کشف توطئه‌ی آمریکایی در پایگاه هوایی شهید نوژه (کودتای نافرجام نقاب)']
        ], false];

        this.events[4][21] = [[
            ['روز عفاف و حجاب'],
            ['حمله به مسجد گوهرشاد و کشتار مردم به دست رضاخان']
        ], false];

        this.events[4][23] = [[
            ['سالروز اشتباه برجام، مایه‌ی عبرت آیندگان'],
            ['گشایش نخستین مجلس خبرگان رهبری']
        ], false];

        this.events[4][25] = [[
            ['روز بهزیستی و تأمین اجتماعی']
        ], false];

        this.events[4][26] = [[
            ['سالروز تأسیس نهاد شورای نگهبان']
        ], false];

        this.events[4][27] = [[
            ['اعلام پذیرش قطعنامه‌ی 598 شورای امنیت از سوی ایران']
        ], false];

        this.events[4][30] = [[
            ['روز بزرگداشت آیت‌اللّه سید ابوالقاسم کاشانی']
        ], false];

        this.events[5][4] = [[
            ['روز بزرگداشت شیخ صفی‌الدین اردبیلی']
        ], false];

        this.events[5][5] = [[
            ['سالروز عملیات افتخار‌آفرین مرصاد']
        ], false];

        this.events[5][6] = [[
            ['روز کارآفرینی و آموزش‌های فنّی‌و‌حرفه‌ای']
        ], false];

        this.events[5][8] = [[
            ['روز بزرگداشت شیخ شهاب‌الدین سهروردی (شیخ اشراق)']
        ], false];

        this.events[5][9] = [[
            ['روز اهدای خون']
        ], false];

        this.events[5][11] = [[
            ['شهادت آیت‌اللّه شیخ فضل‌اللّه نوری']
        ], false];

        this.events[5][14] = [[
            ['صدور فرمان مشروطیت'],
            ['روز حقوق بشر اسلامی و کرامت انسانی']
        ], false];

        this.events[5][15] = [[
            ['انفجار بمب اتمی آمریکا در هیروشیما با بیش از 160هزار کشته و مجروح در سال 1945 میلادی'],
            ['سالروز شهادت امیر سرلشکر خلبان عباس بابایی']
        ], false];

        this.events[5][16] = [[
            ['تشکیل جهاد دانشگاهی']
        ], false];

        this.events[5][17] = [[
            ['روز خبرنگار']
        ], false];

        this.events[5][18] = [[
            ['روز بزرگداشت شهدای مدافع حرم']
        ], false];

        this.events[5][21] = [[
            ['روز حمایت از صنایع کوچک']
        ], false];

        this.events[5][22] = [[
            ['روز تشکّل‌ها و مشارکت‌های اجتماعی']
        ], false];

        this.events[5][23] = [[
            ['روز مقاومت اسلامی']
        ], false];

        this.events[5][26] = [[
            ['آغاز بازگشت آزادگان به میهن اسلامی']
        ], false];

        this.events[5][28] = [[
            ['کودتای آمریکا برای بازگرداندن شاه '],
            ['گشایش مجلس خبرگان برای بررسی نهایی قانون اساسی جمهوری اسلامی ایران']
        ], false];

        this.events[5][30] = [[
            ['روز بزرگداشت علامه مجلسی']
        ], false];

        this.events[5][31] = [[
            ['روز صنعت دفاعی']
        ], false];

        this.events[6][1] = [[
            ['روز بزرگداشت ابوعلی سینا'],
            ['روز پزشک']
        ], false];

        this.events[6][2] = [[
            ['آغاز هفته‌ی دولت'],
            ['شهادت سید‌علی اندرزگو (در روز 19 ماه مبارک رمضان)']
        ], false];

        this.events[6][3] = [[
            ['اِشغال ایران توسّط متّفقین و فرار رضاخان']
        ], false];

        this.events[6][4] = [[
            ['روز کارمند']
        ], false];

        this.events[6][5] = [[
            ['روز بزرگداشت محمّدبن زکریای رازی'],
            ['روز داروسازی'],
            ['روز کشتی']
        ], false];

        this.events[6][8] = [[
            ['روز مبارزه با تروریسم (انفجار دفتر نخست‌وزیری به دست منافقان و شهادت مظلومانه‌ی شهیدان رجایی و باهنر)']
        ], false];

        this.events[6][10] = [[
            ['روز بانکداری اسلامی (سالروز تصویب قانون عملیات بانکی بدون ربا)'],
            ['روز تشکیل قرارگاه پدافند هوایی حضرت خاتم‌الانبیا صلی اللّه علیه و آله']
        ], false];

        this.events[6][11] = [[
            ['روز صنعت چاپ']
        ], false];

        this.events[6][12] = [[
            ['روز مبارزه بااستعمار انگلیس (سالروز شهادت رئیسعلی دلواری)'],
            ['روز بهورز']
        ], false];

        this.events[6][13] = [[
            ['روز تعاون'],
            ['روز بزرگداشت ابوریحان بیرونی'],
            ['روز مردم‌شناسی']
        ], false];

        this.events[6][14] = [[
            ['شهادت آیت‌اللّه قدّوسی و سرتیپ وحید دستجردی']
        ], false];

        this.events[6][17] = [[
            ['قیام 17 شهریور و کشتار جمعی از مردم به‌دست مأموران ستم‌شاهی پهلوی']
        ], false];

        this.events[6][19] = [[
            ['وفات آیت‌اللّه سیدمحمود طالقانی اوّلین امام جمعه‌ی تهران']
        ], false];

        this.events[6][20] = [[
            ['شهادت دومین شهید محراب آیت‌اللّه مدنی به دست منافقان']
        ], false];

        this.events[6][21] = [[
            ['روز سینما']
        ], false];

        this.events[6][27] = [[
            ['روز شعر و ادب فارسی'],
            ['روز بزرگداشت استاد سید‌محمّد‌حسین شهریار']
        ], false];

        this.events[6][31] = [[
            ['آغاز جنگ تحمیلی'],
            ['آغاز هفته‌ی دفاع مقدّس']
        ], false];

        this.events[7][5] = [[
            ['شکست حصر آبادان در عملیات ثامن‌الائمه علیه‌السلام']
        ], false];

        this.events[7][7] = [[
            ['روز بزرگداشت فرماندهان شهید دفاع مقدّس'],
            ['شهادت سرداران اسلام: فلاحی، فکوری، نامجو، کلاهدوز و جهان‌آرا'],
            ['روز آتش‌نشانی و ایمنی'],
            ['روز بزرگداشت شمس']
        ], false];

        this.events[7][8] = [[
            ['روز بزرگداشت مولوی']
        ], false];

        this.events[7][9] = [[
            ['روز همبستگی و همدردی با کودکان و نوجوانان فلسطینی']
        ], false];

        this.events[7][13] = [[
            ['هجرت حضرت امام خمینی (رحمة‌اللّه علیه) از عراق به پاریس'],
            ['روز نیروی انتظامی']
        ], false];

        this.events[7][14] = [[
            ['روز دامپزشکی']
        ], false];

        this.events[7][15] = [[
            ['روز روستا و عشایر']
        ], false];

        this.events[7][20] = [[
            ['روز بزرگداشت حافظ']
        ], false];

        this.events[7][23] = [[
            ['شهادت پنجمین شهید محراب آیت‌اللّه اشرفی اصفهانی به دست منافقان']
        ], false];

        this.events[7][24] = [[
            ['روز ملی پارالمپیک'],
            ['روز پیوند اولیا و مربیان'],
            ['سالروز واقعه‌ی به‌آتش‌کشیدن مسجد جامع شهر کرمان به دست دژخیمان حکومت پهلوی']
        ], false];

        this.events[7][26] = [[
            ['روز تربیت‌بدنی و ورزش']
        ], false];

        this.events[7][29] = [[
            ['روز صادرات']
        ], false];

        this.events[8][1] = [[
            ['شهادت مظلومانه‌ی آیت‌اللّه حاج سید مصطفی خمینی'],
            ['روز آمار و برنامه‌ریزی']
        ], false];

        this.events[8][4] = [[
            ['اعتراض و افشاگری حضرت امام خمینی (ره) علیه پذیرش کاپیتولاسیون']
        ], false];

        this.events[8][8] = [[
            ['شهادت محمّدحسین فهمیده (بسیجی 13 ساله)'],
            ['روز نوجوان و بسیج دانش‌آموزی'],
            ['روز پدافند غیرعامل']
        ], false];

        this.events[8][10] = [[
            ['شهادت آیت‌اللّه قاضی طباطبایی، اوّلین شهید محراب به دست منافقان']
        ], false];

        this.events[8][13] = [[
            ['تسخیر لانه‌ی جاسوسی آمریکا به دست دانشجویان پیرو خط امام'],
            ['روز ملی مبارزه با استکبار جهانی'],
            ['روز دانش‌آموز'],
            ['تبعید حضرت امام خمینی (رحمة‌اللّه علیه) از ایران به ترکیه']
        ], false];

        this.events[8][14] = [[
            ['روز فرهنگ عمومی']
        ], false];

        this.events[8][18] = [[
            ['روز کیفیت']
        ], false];

        this.events[8][24] = [[
            ['روز کتاب، کتاب‌خوانی و کتابدار'],
            ['روز بزرگداشت آیت‌اللّه علامه سیدمحمّدحسین طباطبایی']
        ], false];

        this.events[8][26] = [[
            ['سالروز آزادسازی سوسنگرد']
        ], false];

        this.events[9][5] = [[
            ['روزبسیج مستضعفان (تشکیل بسیج مستضعفان به فرمان حضرت امام خمینی رحمة‌اللّه علیه)'],
            ['سالروز قیام مردم گرگان']
        ], false];

        this.events[9][7] = [[
            ['روز نیروی دریایی']
        ], false];

        this.events[9][9] = [[
            ['روز بزرگداشت شیخ مفید']
        ], false];

        this.events[9][10] = [[
            ['شهادت آیت‌اللّه سید‌حسن مدرّس و روز مجلس']
        ], false];

        this.events[9][11] = [[
            ['شهادت میرزا‌کوچک‌خان جنگلی']
        ], false];

        this.events[9][12] = [[
            ['روز قانون اساسی جمهوری اسلامی ایران (تصویب قانون اساسی جمهوری اسلامی ایران)']
        ], false];

        this.events[9][13] = [[
            ['روز بیمه']
        ], false];

        this.events[9][16] = [[
            ['روز دانشجو']
        ], false];

        this.events[9][18] = [[
            ['معرّفی عراق به عنوان مسئول و آغازگر جنگ از سوی سازمان ملل']
        ], false];

        this.events[9][19] = [[
            ['تشکیل شورای عالی انقلاب فرهنگی به فرمان حضرت امام خمینی (رحمة‌اللّه علیه)']
        ], false];

        this.events[9][20] = [[
            ['شهادت آیت‌اللّه دستغیب، سومین شهید محراب به دست منافقان']
        ], false];

        this.events[9][25] = [[
            ['روز پژوهش']
        ], false];

        this.events[9][26] = [[
            ['روز حمل‌و‌نقل و رانندگان']
        ], false];

        this.events[9][27] = [[
            ['شهادت آیت‌اللّه دکتر محمّد مفتّح'],
            ['روز وحدت حوزه و دانشگاه']
        ], false];

        this.events[9][29] = [[
            ['روز تجلیل از شهید تندگویان']
        ], false];

        this.events[9][30] = [[
            ['شب یلدا']
        ], false];

        this.events[10][3] = [[
            ['روز ثبت‌احوال']
        ], false];

        this.events[10][5] = [[
            ['روز ایمنی در برابر زلزله و کاهش اثرات بلایای طبیعی']
        ], false];

        this.events[10][7] = [[
            ['سالروز تشکیل نهضت سوادآموزی به فرمان حضرت امام خمینی (رحمة‌اللّه علیه)'],
            ['شهادت آیت‌اللّه حسین غفّاری به دست مأموران ستم‌شاهی پهلوی']
        ], false];

        this.events[10][8] = [[
            ['روز صنعت پتروشیمی']
        ], false];

        this.events[10][9] = [[
            ['روز بصیرت و میثاق امّت با ولایت (سالروز حماسه‌ی 9 دی 88)']
        ], false];

        this.events[10][13] = [[
            ['روز جهانی مقاومت - شهادت الگوی اخلاص و عمل، سردار سپهبد حاج قاسم سلیمانی و هم‌رزمان ایشان به دست استکبار جهانی'],
            ['ابلاغ پیام تاریخی حضرت امام خمینی (ره) به گورباچف رهبر شوروی سابق']
        ], false];

        this.events[10][17] = [[
            ['اجرای طرح استعماری حذف حجاب (کشف حجاب) به دست رضاخان دیکتاتور'],
            ['روز بزرگداشت خواجوی کرمانی']
        ], false];

        this.events[10][19] = [[
            ['قیام خونین مردم قم']
        ], false];

        this.events[10][20] = [[
            ['شهادت میرزا تقی خان امیرکبیر']
        ], false];

        this.events[10][22] = [[
            ['شکیل شورای انقلاب به فرمان حضرت امام خمینی (رحمة‌اللّه علیه)']
        ], false];

        this.events[10][26] = [[
            ['فرار شاه معدوم']
        ], false];

        this.events[10][27] = [[
            ['شهادت شهیدان: نواب صفوی، طهماسبی، برادران واحدی و ذوالقدر از فدائیان اسلام']
        ], false];

        this.events[10][29] = [[
            ['روز غزه']
        ], false];

        this.events[11][6] = [[
            ['سالروز حماسه‌ی مردم آمل']
        ], false];

        this.events[11][12] = [[
            ['بازگشت حضرت امام خمینی (رحمة‌اللّه علیه) به ایران و آغاز دهه‌ی مبارک فجر انقلاب اسلامی']
        ], false];

        this.events[11][14] = [[
            ['روز فنّاوری فضایی']
        ], false];

        this.events[11][19] = [[
            ['روز نیروی هوایی']
        ], false];

        this.events[11][21] = [[
            ['شکسته‌شدن حکومت‌نظامی به فرمان امام خمینی (رحمة‌اللّه علیه)']
        ], false];

        this.events[11][22] = [[
            ['پیروزی انقلاب اسلامی ایران و سقوط نظام شاهنشاهی', true]
        ], true];

        this.events[11][25] = [[
            ['صدور حکم تاریخی حضرت امام خمینی (رحمة‌اللّه علیه) مبنی بر ارتداد سلمان‌رشدی نویسنده‌ی خائن کتاب آیات شیطانی']
        ], false];

        this.events[11][29] = [[
            ['قیام مردم تبریز به مناسبت چهلمین روز شهادت شهدای قم'],
            ['روز اقتصاد مقاومتی و کارآفرینی']
        ], false];

        this.events[12][3] = [[
            ['کودتای انگلیسی رضاخان']
        ], false];

        this.events[12][5] = [[
            ['روز بزرگداشت خواجه‌نصیرالدّین طوسی'],
            ['روز مهندسی']
        ], false];

        this.events[12][8] = [[
            ['روز امور تربیتی و تربیت اسلامی'],
            ['روز بزرگداشت حکیم حاج ملاهادی سبزواری']
        ], false];

        this.events[12][9] = [[
            ['روز حمایت از حقوق مصرف‌کنندگان']
        ], false];

        this.events[12][14] = [[
            ['روز احسان و نیکوکاری'],
            ['روز ترویج فرهنگ قرض‌الحسنه']
        ], false];

        this.events[12][15] = [[
            ['روز درختکاری']
        ], false];

        this.events[12][18] = [[
            ['روز بزرگداشت سید‌جمال‌الدّین اسدآبادی'],
            ['سالروز تأسیس کانون‌های فرهنگی‌و‌هنری مساجد کشور']
        ], false];

        this.events[12][20] = [[
            ['روز راهیان نور']
        ], false];

        this.events[12][21] = [[
            ['روز بزرگداشت نظامی گنجوی']
        ], false];

        this.events[12][22] = [[
            ['روز بزرگداشت شهدا (سالروز صدور فرمان حضرت امام خمینی رحمة‌اللّه علیه، مبنی بر تأسیس بنیاد شهید انقلاب اسلامی)']
        ], false];

        this.events[12][25] = [[
            ['بمباران شیمیایی حلبچه به دست ارتش بعث عراق']
        ], false];

        this.events[12][29] = [[
            ['روز ملّی‌شدن صنعت نفت ایران', true]
        ], true];

        this.events[12][30] = [[
            ['این روز فقط در سال‌های کبیسه وجود دارد و معمولاً تعطیل اعلام می‌گردد']
        ], false];

    }
};
