function iranLunar() {
    this._init();
}

iranLunar.prototype = {
    name: 'مناسبت‌های مذهبی ایران',
    type: 'hijri',
    /* [month][day] = [title, isHoliday] */
    events: [[], [], [], [], [], [], [], [], [], [], [], [], []],

    _init: function () {/** Edit by: jdf.scr.ir */

        this.events[1][1] = [[
            ['آغاز سال هجری قمری (اوّل ماه محرّم)']
        ], false];

        this.events[1][9] = [[
            ['تاسوعای حسینی', true]
        ], true];

        this.events[1][10] = [[
            ['عاشورای حسینی', true]
        ], true];

        this.events[1][11] = [[
            ['روز تجلیل از اسرا و مفقودان']
        ], false];

        this.events[1][12] = [[
            ['شهادت حضرت امام زین‌العابدین علیه‌السلام']
        ], false];

        this.events[1][25] = [[
            ['شهادت حضرت امام زین‌العابدین علیه‌السلام :به روایتی']
        ], false];

        this.events[2][7] = [[
            ['شهادت حضرت امام حسن مجتبی علیه‌السلام :به روایتی'],
            ['روز بزرگداشت سلمان فارسی']
        ], false];

        this.events[2][20] = [[
            ['اربعین حسینی', true]
        ], true];

        this.events[2][27] = [[
            ['روز وقف']
        ], false];

        this.events[2][28] = [[
            ['رحلت حضرت رسول اکرم صلی اللّه علیه و آله', true],
            ['شهادت حضرت امام حسن مجتبی علیه‌السلام', true]
        ], true];

        this.events[2][29] = [[
            ['شهادت حضرت امام رضا علیه‌السلام', true]
        ], true];

        this.events[3][1] = [[
            ['هجرت حضرت رسول اکرم صلی اللّه علیه و آله از مکّه به مدینه']
        ], false];

        this.events[3][8] = [[
            ['شهادت حضرت امام حسن عسکری علیه‌السلام', true],
            ['آغاز امامت حضرت ولی‌عصر (عج)', true]
        ], true];

        this.events[3][12] = [[
            ['ولادت حضرت رسول اکرم صلی اللّه علیه و آله :به روایت اهل سنت'],
            ['آغاز هفته‌ی وحدت']
        ], false];

        this.events[3][17] = [[
            ['ولادت حضرت رسول اکرم صلی اللّه علیه و آله - روز اخلاق و مهرورزی', true],
            ['ولادت حضرت امام جعفر صادق علیه‌السلام، مؤسس مذهب جعفری', true]
        ], true];

        this.events[4][4] = [[
            ['ولادت حضرت عبدالعظیم حسنی علیه‌السلام']
        ], false];

        this.events[4][8] = [[
            ['ولادت حضرت امام حسن عسکری علیه‌السلام']
        ], false];

        this.events[4][10] = [[
            ['وفات حضرت معصومه سلام‌اللّه علیها']
        ], false];

        this.events[5][5] = [[
            ['ولادت حضرت زینب سلام‌اللّه علیها و روز پرستار']
        ], false];

        this.events[5][13] = [[
            ['شهادت حضرت فاطمه‌ی زهرا سلام‌اللّه علیها :به روایتی']
        ], false];

        this.events[6][3] = [[
            ['شهادت حضرت فاطمه‌ی زهرا سلام‌اللّه علیها', true]
        ], true];

        this.events[6][13] = [[
            ['سالروز وفات حضرت اُم‌البنین سلام‌اللّه علیها'],
            ['روز تکریم مادران و همسران شهدا']
        ], false];

        this.events[6][20] = [[
            ['ولادت حضرت فاطمه‌ی زهرا سلام‌اللّه علیها و روز زن'],
            ['تولّد حضرت امام خمینی (رحمة‌اللّه علیه)، رهبر کبیر انقلاب اسلامی'],
            ['روز مادر - روز زن']
        ], false];

        this.events[7][1] = [[
            ['ولادت حضرت امام محمّد باقر علیه‌السلام']
        ], false];

        this.events[7][3] = [[
            ['شهادت حضرت امام علی نقی «هادی» علیه‌السلام']
        ], false];

        this.events[7][10] = [[
            ['ولادت حضرت امام محمد تقی علیه‌السلام «جوادالائمه»']
        ], false];

        this.events[7][13] = [[
            ['ولادت حضرت امام علی علیه‌السلام', true],
            ['آغاز ایام البیض (اعتکاف)'],
            ['روز پدر - روز مرد']
        ], true];

        this.events[7][15] = [[
            ['ارتحال حضرت زینب کبری سلام‌اللّه علیها'],
            ['تغییر قبله‌ی مسلمین از بیت‌المقدس به مکّه‌ی معظّمه']
        ], false];

        this.events[7][25] = [[
            ['شهادت حضرت امام موسی کاظم علیه‌السلام']
        ], false];

        this.events[7][27] = [[
            ['مبعث حضرت رسول اکرم صلی‌اللّه علیه و آله', true]
        ], true];

        this.events[8][3] = [[
            ['ولادت حضرت امام حسین علیه‌السلام و روز پاسدار']
        ], false];

        this.events[8][4] = [[
            ['ولادت حضرت ابوالفضل‌العباس علیه‌السلام و روز جانباز']
        ], false];

        this.events[8][5] = [[
            ['ولادت حضرت امام زین‌العابدین علیه‌السلام']
        ], false];

        this.events[8][11] = [[
            ['ولادت حضرت علی‌اکبر علیه‌السلام و روز جوان']
        ], false];

        this.events[8][15] = [[
            ['ولادت حضرت قائم عجل‌اللّه تعالی فرجه (جشن صاحب‌الزّمان) و روز جهانی مستضعفان', true],
            ['روز سربازان گمنام امام زمان (عج)']
        ], true];

        this.events[9][10] = [[
            ['وفات حضرت خدیجه سلام‌اللّه علیها']
        ], false];

        this.events[9][15] = [[
            ['ولادت حضرت امام حسن مجتبی علیه‌السلام'],
            ['روز اکرام و تکریم خیّرین']
        ], false];

        this.events[9][18] = [[
            ['شب قدر']
        ], false];

        this.events[9][19] = [[
            ['ضربت‌خوردن حضرت امام علی علیه‌السلام']
        ], false];

        this.events[9][20] = [[
            ['شب قدر']
        ], false];

        this.events[9][21] = [[
            ['شهادت امیر‌المؤمنین، حضرت امام علی علیه‌السلام', true]
        ], true];

        this.events[9][22] = [[
            ['شب قدر']
        ], false];

        this.events[9][23] = [[
            ['پیش‌یادآوری: آخرین جمعه‌ی ماه مبارک رمضان، روز قدس خواهد‌بود']
        ], false];

        this.events[10][1] = [[
            ['عید سعید فطر', true]
        ], true];

        this.events[10][2] = [[
            ['تعطیل به مناسبت عید سعید فطر', true]
        ], true];

        this.events[10][17] = [[
            ['روز فرهنگ پهلوانی و ورزش زورخانه‌ای']
        ], false];

        this.events[10][21] = [[
            ['فتح اندلس به دست مسلمانان']
        ], false];

        this.events[10][25] = [[
            ['شهادت حضرت امام جعفر صادق علیه‌السلام', true]
        ], true];

        this.events[11][1] = [[
            ['ولادت حضرت معصومه سلام‌اللّه علیها و روز دختران']
        ], false];

        this.events[11][5] = [[
            ['روز تجلیل از امام‌زادگان و بقاع متبرکه'],
            ['روز بزرگداشت حضرت صالح بن موسی کاظم علیه‌السلام']
        ], false];

        this.events[11][6] = [[
            ['روز بزرگداشت حضرت احمد بن موسی شاهچراغ علیه‌السلام']
        ], false];

        this.events[11][11] = [[
            ['ولادت حضرت امام رضا علیه‌السلام']
        ], false];

        this.events[11][29] = [[
            ['آخرین روز (29 یا 30) ماه ذی‌القعده: شهادت حضرت امام محمد تقی علیه‌السلام «جوادالائمه»']
        ], false];

        this.events[11][30] = [[
            ['شهادت حضرت امام محمد تقی علیه‌السلام «جوادالائمه»']
        ], false];

        this.events[12][1] = [[
            ['سالروز ازدواج حضرت امام علی علیه‌السلام و حضرت فاطمه سلام‌اللّه علیها'],
            ['روز ازدواج']
        ], false];

        this.events[12][6] = [[
            ['شهادت مظلومانه‌ی زائران خانه‌ی خدا به دست مأموران آل‌سعود در سال 1366 هجری‌شمسی']
        ], false];

        this.events[12][7] = [[
            ['شهادت حضرت امام محمد باقر علیه‌السلام']
        ], false];

        this.events[12][9] = [[
            ['روز عرفه (روز نیایش)']
        ], false];

        this.events[12][10] = [[
            ['عید سعید قربان', true]
        ], true];

        this.events[12][15] = [[
            ['ولادت حضرت امام علی نقی «هادی» علیه‌السلام']
        ], false];

        this.events[12][18] = [[
            ['عید سعید غدیر خم', true]
        ], true];

        this.events[12][20] = [[
            ['ولادت حضرت امام موسی کاظم علیه‌السلام']
        ], false];

        this.events[12][24] = [[
            ['روز مباهله‌ی پیامبر اسلام صلی‌اللّه علیه و آله']
        ], false];

        this.events[12][25] = [[
            ['روز خانواده و تکریم بازنشستگان']
        ], false];

    }
};
