// copyright http://freemind.ir/1393/03/2014-world-cup-google-calendar/

function wc2014() {
    this._init();
};

wc2014.prototype = {
    name: 'تقویم بازی‌های جام‌جهانی برزیل ۲۰۱۴',
    type: 'persian',
    events: [[],[],[],[],[],[],[],[],[],[],[],[],[]],
    
    _init: function() {
		this.events[3][23] = [];
        this.events[3][23][0] = ['۱۲:۳۰', '‫برزیل - کرواسی‬'],
        this.events[3][23][1] = ['۲۰:۳۰', 'کامرون - مکزیک'],
        this.events[3][23][2] = ['۲۳:۳۰', 'هلند - اسپانیا'],
        
        this.events[3][24] = [];
        this.events[3][24][0] = ['۰۲:۳۰', 'شیلی - استرالیا'],
        this.events[3][24][1] = ['۲۰:۳۰', 'کلمبیا - یونان'],
        this.events[3][24][2] = ['۲۳:۳۰', 'اروگوئه - کاستاریکا'],
        
        this.events[3][25] = [];
        this.events[3][25][0] = ['۰۲:۳۰', 'انگلیس - ایتالیا'],
        this.events[3][25][1] = ['۲۰:۳۰', 'سوئیس - اکودور'],
        this.events[3][25][2] = ['۲۳:۳۰', 'فرانسه - هندوراس'],
        
        this.events[3][26] = [];
        this.events[3][26][0] = ['۰۲:۳۰', 'آرژانتین - بوسنی و هرزگوین'],
        this.events[3][26][1] = ['۰۲:۳۰', 'ساحل عاج - ژاپن'],
        this.events[3][26][2] = ['۲۰:۳۰', 'آلمان - پرتغال'],
        this.events[3][26][3] = ['۲۳:۳۰', 'ایران - نیجریه'],
        
        this.events[3][27] = [];
        this.events[3][27][0] = ['۰۲:۳۰', 'غنا - آمریکا'],
        this.events[3][27][1] = ['۲۰:۳۰', 'بلژیک - الجزایر'],
        this.events[3][27][2] = ['۲۳:۳۰', 'برزیل - مکزیک'],
        
        this.events[3][28] = [];
        this.events[3][28][0] = ['۰۲:۳۰', 'روسیه - کره جنوبی'],
        this.events[3][28][1] = ['۲۰:۳۰', 'استرالیا - هلند'],
        this.events[3][28][2] = ['۲۳:۳۰', 'اسپانیا - شیلی'],
        
        this.events[3][29] = [];
        this.events[3][29][0] = ['۰۲:۳۰', 'کامرون - کرواسی'],
        this.events[3][29][1] = ['۲۰:۳۰', 'کلمبیا - ساحل عاج'],
        this.events[3][29][2] = ['۲۳:۳۰', 'اروگوئه - انگلیس'],
        
        this.events[3][30] = [];
        this.events[3][30][0] = ['۰۲:۳۰', 'ژاپن - یونان'],
        this.events[3][30][1] = ['۲۰:۳۰', 'ایتالیا - کاستاریکا'],
        this.events[3][30][2] = ['۲۳:۳۰', 'سوئیس - فرانسه'],
        
        this.events[3][31] = [];
        this.events[3][31][0] = ['۰۲:۳۰', 'هندوراس - اکوادور'],
        this.events[3][31][1] = ['۲۰:۳۰', 'آرژانتین - ایران'],
        this.events[3][31][2] = ['۲۳:۳۰', 'آلمان - غنا'],
        
        this.events[4][1] = [];
        this.events[4][1][0] = ['۰۲:۳۰', 'نیجریه - بوسنی و هرزگوین'],
        this.events[4][1][1] = ['۲۰:۳۰', 'بلژیک - روسیه'],
        this.events[4][1][2] = ['۲۳:۳۰', 'کره‌جنوبی - الجزایر'],
        
        this.events[4][2] = [];
        this.events[4][2][0] = ['۰۲:۳۰', 'آمریکا - پرتغال'],
        this.events[4][2][1] = ['۲۰:۳۰', 'استرالیا - اسپانیا'],
        this.events[4][2][2] = ['۲۰:۳۰', 'هلند - شیلی'],
        
        this.events[4][3] = [];
        this.events[4][3][0] = ['۱۲:۳۰', 'کامرون - برزیل'],
        this.events[4][3][1] = ['۱۲:۳۰', 'کرواسی - مکزیک'],
        this.events[4][3][2] = ['۲۰:۳۰', 'ایتالیا - اروگوئه'],
        this.events[4][3][3] = ['۲۰:۳۰', 'کاستاریکا - انگلیس'],
        
        this.events[4][4] = [];
        this.events[4][4][0] = ['۱۲:۳۰', 'ژاپن - کلمبیا'],
        this.events[4][4][1] = ['۱۲:۳۰', 'یونان - ساحل عاج'],
        this.events[4][4][2] = ['۲۰:۳۰', 'بوسنی و هرزگوین - ایران'],
        this.events[4][4][3] = ['۲۰:۳۰', 'نیجریه - آرژانتین'],
        
        this.events[4][5] = [];
        this.events[4][5][0] = ['۱۲:۳۰', 'اکوادور - فرانسه'],
        this.events[4][5][1] = ['۱۲:۳۰', 'هندوراس - سوئیس'],
        this.events[4][5][2] = ['۲۰:۳۰', 'آمریکا - آلمان'],
        this.events[4][5][3] = ['۲۰:۳۰', 'پرتغال - غنا'],
        this.events[4][5][4] = ['۲۲:۳۰', 'الجزایر - روسیه'],
        this.events[4][5][5] = ['۲۲:۳۰', 'کره‌جنوبی - بلژیک'],
        
        this.events[4][7] = [];
        this.events[4][7][0] = ['۲۰:۳۰', 'یک‌هشتم نهایی'],
        
        this.events[4][8] = [];
        this.events[4][8][0] = ['۱۲:۳۰', 'یک‌هشتم نهایی'],
        this.events[4][8][1] = ['۲۰:۳۰', 'یک‌هشتم نهایی'],
        
        this.events[4][9] = [];
        this.events[4][9][0] = ['۱۲:۳۰', 'یک‌هشتم نهایی'],
        this.events[4][9][1] = ['۲۰:۳۰', 'یک‌هشتم نهایی'],
        
        this.events[4][10] = [];
        this.events[4][10][0] = ['۱۲:۳۰', 'یک‌هشتم نهایی'],
        this.events[4][10][1] = ['۲۰:۳۰', 'یک‌هشتم نهایی'],
        
        this.events[4][11] = [];
        this.events[4][11][0] = ['۱۲:۳۰', 'یک‌هشتم نهایی'],
        
        this.events[4][13] = [];
        this.events[4][13][0] = ['۲۰:۳۰', 'یک‌چهارم نهایی'],
        
        this.events[4][14] = [];
        this.events[4][14][0] = ['۱۲:۳۰', 'یک‌چهارم نهایی'],
        this.events[4][14][1] = ['۲۰:۳۰', 'یک‌چهارم نهایی'],
        
        this.events[4][15] = [];
        this.events[4][15][0] = ['۱۲:۳۰', 'یک‌چهارم نهایی'],
        
        this.events[4][18] = [];
        this.events[4][18][0] = ['۱۲:۳۰', 'نیمه‌نهایی'],
        
        this.events[4][19] = [];
        this.events[4][19][0] = ['۱۲:۳۰', 'نیمه‌نهایی'],
        
        this.events[4][22] = [];
        this.events[4][22][0] = ['۱۲:۳۰', 'رده‌بندی'],
        this.events[4][22][1] = ['۲۳:۳۰', 'فینال'],
        
        this.events.forEach( function (element, index, array) {
			element.forEach( function (element, index, array) {
				element.forEach( function (element, index, array) {
					array[index] = element[1] + " ساعت " + element[0];
				});
				array[index] = [element.join("\n"), false];
			});
		});
    }
};
