// copyright http://www.farhangiran.com
function world() {
	this._init();
};

world.prototype = {
	name: 'مناسبت‌های جهانی',
	events: [
		// farvardin // +0
		[1, 'روز جهانی شعر', false],
		[2, 'روز جهانی آب', false],
		[3, 'روز جهانی هواشناسی', false],
		[15, 'روز جهانی ضد مین', false],
		[18, 'روز جهانی بهداشت', false],
		[23, 'روز جهانی کیهان نوردی', false],
		// ordibehesht // +31
		[34, 'روز جهانی کتاب', false],
		[42, 'روز جهانی کار', false],
		[43, 'روز جهانی مطبوعات', false],
		[56, 'روز جهانی خانواده', false],
		[58, 'روز جهانی ارتباطات', false],
		[62, 'روز جهانی گفتگوی تمدن‌ها', false],
		// khordad // +62
		[63, 'روز جهانی بیولوژی', false],
		[70, 'روز جهانی کلاه آبی‌های سازمان ملل', false],
		[72, 'روز جهانی بدون دخانیات', false],
		[76, 'روز جهانی کودکان قربانی تجاوز', false],
		[77, 'روز جهانی زیست بوم', false],
		[89, 'روز جهانی مبارزه با بیابان و خشک‌سالی', false],
		[92, 'روز جهانی پناهندگان', false],
		// tir // +93
		[95, 'روز جهانی خدمات دولتی', false],
		[98, 'روز جهانی مبارزه با مواد مخدر', false],
		[113, 'روز جهانی جمعیت', false],
		// mordad // +124
		[142, 'روز جهانی بومیان', false],
		[145, 'روز جهانی جوانان', false],
		// shahrivar // +155
		[164, 'روز جهانی وبلاگ', false],
		[172, 'روز جهانی دانش‌آموزی', false],
		[179, 'روز جهانی مردم سالاری', false],
		[180, 'روز جهانی نگه‌داری از لایه ازن', false],
		[185, 'روز جهانی صلح', false],
		// mehr // +186
		[194, 'روز جهانی سالمندان', false],
		[199, 'روز جهانی آموزگار', false],
		[202, 'روز جهانی کودک', false],
		[203, 'روز جهانی پست', false],
		[204, 'روز جهانی بهداشت روان', false],
		[210, 'روز جهانی خوراک', false],
		[211, 'روز جهانی مبارزه با فقر', false],
		// aban // +216
		[218, 'روز جهانی سارمان ملل / روز جهانی اخبار', false],
		[239, 'روز جهانی دیانت', false],
		[241, 'روز جهانی مدارا', false],
		[246, 'روز جهانی تلویزیون', false],
		// azar // +246
		[251, 'روز جهانی مبارزه با خشونت علیه زنان', false],
		[256, 'روز جهانی مبارزه با ایدز', false],
		[257, 'روز جهانی آزادی بردگان', false],
		[258, 'روز جهانی ناتوان', false],
		[262, 'روز جهانی هواپیمایی', false],
		[265, 'روز جهانی حقوق بشر', false],
		[266, 'روز جهانی کوهستان', false],
		[273, 'روز جهانی مهاجرین', false],
		[275, 'روز جهانی همبستگی انسانی', false],
		// dey // +276
		// bahman // +306
		// esfand // +336
		[337, 'روز جهانی عدالت اجتماعی', false],
		[338, 'روز جهانی زبان مادری', false],
		[353, 'روز جهانی زن', false],
		[357, 'روز جهانی آزادی گفتار', false]
	],
	
	_init: function() {
    }
};
